Add LLM docs
